#ifndef _BEEP_DRIVERS_H_
#define _BEEP_DRIVERS_H_
#include "app_config.h"

#if APP_BEEP_ENABLE
/********************************************************
**	函数名	void BEEP_Init(void)
**	描述	：蜂鸣器GPIO初始化
**	传入	：无
**	返回	：无
*********************************************************/
void BEEP_Init(void);
/********************************************************
**	函数名	void BEEP_On(uint8_t timeout)
**	描述	：打开蜂鸣器
**	传入	：timeout 开启时间ms
**	返回	：无
*********************************************************/
void BEEP_On(uint8_t timeout);
/********************************************************
**	函数名	void BEEP_Timeout(void)
**	描述	：延时关闭蜂鸣器，系统定时器中断调用，调用周期1ms
**	传入	：t无
**	返回	：无
*********************************************************/
void BEEP_Timeout(void);
#endif
#endif

