#ifndef _SMG_DRIVERS_H_
#define _SMG_DRIVERS_H_

#include "app_config.h"
#if APP_SMG_ENABLE
/********************************************************
**	函数名	void SMG_Init(void)
**	描述	数码管IO口初始化，
**	传入	：无
**	返回	：无
*********************************************************/
void SMG_Init(void);
/********************************************************
**	函数名	void SMG_Sleep(void)
**	描述	数码管休眠，设置IO口状态
**	传入	：无
**	返回	：无
*********************************************************/
void SMG_Sleep(void);
/********************************************************
**	函数名	void SMG_Wake(void)
**	描述	数码管退出休眠，继续显示
**	传入	：无
**	返回	：无
*********************************************************/
void SMG_Wake(void);
/********************************************************
**	函数名	void SMG_Scan(void)
**	描述	数码管扫描
**	传入	：无
**	返回	：无
*********************************************************/
void SMG_Scan(void);
/********************************************************
**	函数名	void SMG_Default(void)
**	描述	：设置上电默认显示内容
**	传入	：无
**	返回	：无
*********************************************************/
void SMG_Default(void);
#endif
#endif
